zhac-project/zhac-wired-core/sdkconfig.defaults
# SPDX-FileCopyrightText: 2025-2026 Evgenij Cjura and project contributors
# SPDX-License-Identifier: AGPL-3.0-or-later
#
# zhac-wired-core sdkconfig.defaults — derived from zhac-mono-core with:
#   - target esp32s3 -> esp32p4
#   - all CONFIG_ESP_WIFI_* dropped (no WiFi anywhere in this build)
#   - CONFIG_SPIRAM_MODE_OCT dropped (S3 octal PSRAM; P4 configures its own)
#   - CONFIG_ESP32S3_DEFAULT_CPU_FREQ_* dropped (P4 default clock is correct)
#   + Ethernet MAC/PHY
CONFIG_IDF_TARGET="esp32p4"

# Silicon revision family. TAKEN FROM zhac-main-core -- READ THIS BEFORE EDITING.
#
# ESP32-P4 is split into two incompatible revision families, and ONE Kconfig
# picks which one a binary targets:
#
#   ESP32P4_SELECTS_REV_LESS_V3=y  -> rev choices v0.0 / v0.1 / v1.0, MAX 199
#   ESP32P4_SELECTS_REV_LESS_V3=n  -> rev choices v3.0 / v3.1,        MAX 399
#
# (esp_hw_support/port/esp32p4/Kconfig.hw_support; the gate also moves the
# bootloader offset 0x2000 -> 0x1000-ish, and changes esp_pm CPU power-down and
# spi_flash TSUS/TRES support.)
#
# A binary built for one family will NOT boot on the other, so this is a real
# either/or, not a "minimum" in the usual sense.
#
# We match zhac-main-core: the LESS_V3 family, minimum rev v0.0. That is the
# config validated on ZHAC's P4 hardware, and the WT0132P4-A1 bench rig is rev
# v1.3, which the v3.x family cannot target at all.
#
# ⚠ THE GUITION BOARD'S REVISION IS UNCONFIRMED. If its first boot line reads
# `chip: esp32p4, rev v3.x`, this binary will not run on it -- flip
# ESP32P4_SELECTS_REV_LESS_V3 to `n` and pick ESP32P4_REV_MIN_300 instead.
#
# ⚠ Setting REV_MIN_0 WITHOUT the gate is silently useless: the symbol is known
# to kconfgen but unselectable, so it is dropped to the default (_301) with NO
# warning -- not even "unknown kconfig symbol". Verified by experiment. Always
# check the RESOLVED value:  grep ESP32P4_REV_MIN_FULL sdkconfig
# A revision mismatch fails at FLASH time; a green build proves nothing.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_0=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# PSRAM is mandatory. RODATA + BSS placement are near-free on P4 thanks to
# its separate flash/PSRAM buses and L2 cache (same rationale as main-core).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Flash: QIO @ 40 MHz, matching zhac-main-core rather than the IDF defaults
# this project would otherwise land on (DIO @ 80 MHz). main-core's values are
# the ones proven on ZHAC P4 hardware; 80 MHz in particular is not worth
# assuming on a board nobody has flashed yet.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_COMPILER_STACK_CHECK_MODE_STRONG=y
CONFIG_FREERTOS_ISR_STACKSIZE=4192
# Renamed in IDF v6.0 (was CONFIG_MAIN_TASK_STACK_SIZE; kconfgen still
# auto-replaces the old name, but only with an `info:` line nobody reads).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4192

CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_LWIP_MAX_SOCKETS=16

# Ethernet: internal EMAC + external RMII PHY.
#
# Only CONFIG_ETH_USE_ESP32_EMAC is a real symbol here. The RMII interface
# selection and the REF_CLK direction are NOT Kconfig on esp32p4 -- they are
# runtime fields of eth_esp32_emac_config_t, set in eth.cpp. Earlier drafts
# of this file also carried CONFIG_ETH_PHY_INTERFACE_RMII and
# CONFIG_ETH_RMII_CLK_INPUT; both are unknown symbols in IDF v6.0 and were
# silently ignored, implying configuration that was not happening.
#
# Catch that class with:
#   idf.py reconfigure 2>&1 | grep 'unknown kconfig symbol'
# It has bitten this file twice (these two).
#
# NOTE that grep does NOT catch the OTHER silent-drop class -- a symbol that
# kconfgen knows but cannot select, which it drops to the default without any
# warning (see the ESP32P4_REV_MIN block above). Only checking the RESOLVED
# value catches that, which is what tools/check_resolved_config.sh does.
CONFIG_ETH_USE_ESP32_EMAC=y

# 360 MHz, matching zhac-main-core. The IDF default for esp32p4 is 400 MHz;
# main-core deliberately runs 360 and that is the clock ZHAC's P4 firmware is
# actually validated at. PSRAM here is HEX mode @ 200 MHz (IDF default for
# this part, and identical to main-core), which shares the MPLL.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_MBEDTLS_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_LWIP_TCP_WND_DEFAULT=11520
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# No radio in Phase 0. Deliberately absent: CONFIG_ZHAC_NCP_ZNP / _EZSP / _C6.
# Phase 1 selects the esp-zigbee backend (ot_rcp on the onboard C6).
